[
  {
    "name": "Asian Pickled Vegetables",
    "slug": "asian_pickled_vegetables",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/pickled_vegetables.md",
    "recipe": "__Whisk:__\n\n* 1/4 cup rice vinegar\n* 2 teaspoons sugar\n* 1 teaspoon soy sauce\n* 1 teaspoon fish sauce\n* Some red pepper flakes\n\n__Then toss in some sliced vegetables. Suggestions include:__\n\n* cucumbers\n* carrots\n* onions\n* radishes\n\nMix, cover and chill in fridge for at least 30 minutes before using.",
    "tags": []
  },
  {
    "name": "Charred Corn",
    "slug": "charred_corn",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/charred_corn.md",
    "recipe": "* 6-8 ears of very fresh sweet corn.\n* Canola, peanut or other high-heat vegetable oil.\n* Sheet pan covered with tin foil.\n* Good long tongs.\n* Large metal bowl.\n\n1. Prepare the oven for broiling by moving a single rack to the highest level. It should be no closer than 2-3 inches from the broiler.\n2. Under this rack set the second rack and the sheet pan covered with tin foil to catch drips from the corn.\n3. Brush each ear of corn lightly with oil.\n4. Pull out top rack halfway and place the corn directly on the rack.\n5. Push the rack in and turn on the broiler.\n6. Watch the corn. You're looking for some fairly blackened bits and lots of dark brown.\n7. Note: Do not let the corn catch on fire.\n8. Turn the corn one quarter turn with the tongs. Repeat until each corn ear is fairly dark brown.\n9. Remove the corn ears to the large metal bowl they are fully turned and browned/charred.\n10. Turn off the broiler.\n11. Let the corn cool for 15 minutes or until you can touch it.\n12. Stand an ear of corn up on the bottom.\n13. Using your sharpest knife, start at the top of the corn ear and slice down through the kernels. They will come off in sheets.\n14. Turn the corn a quarter or a fifth turn and repeat until you've removed the kernels. Note: Some will stick at the top and bottom.\n15. Do this for each ear of corn.\n16. Now you have a bowl full of kernels. Mix with lime juice (2 limes?) and 3-6 oz of cotija to make a corn salad.\n17. BONUS: Freeze the cobs. Later, make corn stock by boiling the cobs for an hour in 2 gallons of water. Remove the cobs and reduce to about 2 quarts. Use with grits or as a soup base.",
    "tags": []
  },
  {
    "name": "Cilantro and Onion",
    "slug": "cilantro_and_onion",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/cilantro_and_onion.md",
    "recipe": "Chop up some cilantro and onion (any variety) and  put them on any taco.",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Avocado Mango Cilantro Salsa",
    "slug": "avocado_mango_cilantro_salsa",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/avocado_mango_cilantro_salsa.md",
    "recipe": "Recipe adapted from [nom nom paleo](http://nomnompaleo.com/post/56076300574/mango-avocado-salsa-on-pan-seared-salmon).\n\nIn a bowl, combine:\n* 2 cups diced ripe mango (about 2 mangos)\n* ½ cup finely diced red onion\n* 1 cup diced avocado (1 medium avocado)\n* ¼ cup minced fresh cilantro\n* 2 tablespoons extra virgin olive oil\n* freshly ground black pepper\n* big pinch of salt\n* ¼ teaspoon red pepper flakes\n* Juice from 1 lime",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Spicy Mango Salsa",
    "slug": "spicy_mango_salsa",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/mango-peach-salsa-spicy.md",
    "recipe": "Do you enjoy the sweetness of mangos and peaches, the refreshing flavor of lime and the hit of jalapeno? Look no further. I mixed and matched the best parts from [All Recipes](http://allrecipes.com/recipe/15059/spicy-mango-salsa/) and [Little Chef Big Appetite](http://littlechefbigappetite.com/best-spicy-mango-salsa-recipe/) to give you a delicious concoction.\n\n## Ingredients\n\nYou will need:\n* 2 cups diced fresh mango\n* 1 cup fresh chopped peaches\n* 1/2 cup red bell pepper, diced\n* 1/8 cup red onion, minced\n* 1 teaspoon jalapeno, minced\n* 1/4 cup lime juice\n* 1/4 cup chopped basil or cilantro\n* 1 teaspoon freshly chopped pickled ginger (optional)\n\n\n## Directions\n\n1. Mix together mangoes, peaches, basil/cilantro and ginger (if you use it).\n2. Add the jalapenos and lime juice to your liking. Add more hit at your own risk.\n3. Allow to chill for 2 hours (very optional. I mean, who are we kidding?).\n\n### Prep: 15-20 mins\n### Ready In: 5 mins - 2 hours 5 mins\n",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Above Average Tomato Sauce",
    "slug": "above_average_tomato_sauce",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/tomato_sauce_above_average.md",
    "recipe": "## Ingredients\n\n* 1 24oz jar or can of crushed tomatoes or tomato puree\n* 1 T olive oil\n* 1/4 to 1/2 of a medium onion\n* 2 cloves garlic\n* 1 red bell pepper\n* 1 t Italian seasoning\n* salt to taste\n\n## Instructions\n\n1. Chop onion, garlic and pepper.\n2. Heat olive oil in a skillet and sautee the onion and garlic until the onion is translucent.\n3. Add salt, Italian seasoning and bell pepper and sautee until the pepper begins to soften.\n4. Add crushed tomatos and simmer while the rest of your meal cooks.",
    "tags": ["vegan", "vegetarian"]
  },
  {
    "name": "Guacamole",
    "slug": "guacamole",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/guacamole.md",
    "recipe": "This is pretty canonical stuff right here.\n\n* 1-2 ripe Hass avocados\n* half a lime\n* a clove or two of chopped garlic\n* some chopped white or yellow onion\n* salt\n* pepper\n* dry cayenne or red chile pepper powder\n* a jalapeño, if that's your thing\n* a small chopped tomato\n* a handful of chopped cilantro\n\nLook, here's how this works: First, you squeeze the lime juice into your nice little ceramic bowl. Then you add the garlic, onion, spices, peppers if you're heating it up, and then **walk away**.\n\nSeriously, walk away for a minute. Crack open a nice Negra Modelo and use a wedge of the other half of the lime in it. Back in your bowl, let the strong stuff marinate in that lime juice for a few minutes. It's cooking.\n\nOK, now that you're back, mix in the rest of the non-avocado ingredients. If you have a pestle, now's it's time to shine. If not, use a small wooden spoon, or failing all else, a fork, you miserable lout. \n\nMash up everything but the avocado. Get it pasty if you can. Squish it all up.\n\nNow you can add your avocado or two, dude. I usually go with about 1.5 avos to condiment tacos or taco-like structures for four humans of varying sizes.\n\nJust in case no one ever taught you how to deal with an avocado correctly, here's a quick lesson:\n* Cut it in half, longways.\n* Smack the pit with the sharp edge of your knife and give it a sensible 90-degree twist.\n* Voila, the avocado pit is on your knife.\n* Dispose of it, unless you're not going to finish all that guac now, in which case, hang onto it and put it in the bowl with the guac before you put it in the fridge.\n* Now that your knife is free, use it to carve long slices into the flesh of your avocado, one half at a time. Cross-hatch that sucker a bit. Don't cut through the flesh.\n* Finally, get your avocado half above your nice bowl full of deliciousness, and use the skin to gently push your nice slices into the spicy soup below. Turn it inside-out, if you must, but know that you can minimize the amount of avocado that gets all over your hands if you do this just right.\n\nTo finish up your guacamole, mash your avocado up a bit and gently mix it into the magical citric-spice-tomato concoction. We're done here.\n\n_Thanks to [The Awl](http://www.theawl.com/2010/02/half-baked-guacamole-by-the-ceviche-method) for limited inspiration regarding the limey and drinky parts._",
    "tags": ["vegetarian"]
  },
  {
    "name": "Mango Lime Salsa",
    "slug": "mango_lime_salsa",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/mango_lime_salsa.md",
    "recipe": "This fresh mango salsa is sweet, tangy, and simple. It pairs exceedingly well with Garlic Lime Sauce for delicious fish tacos. The recipe is a simplified version of the [mango salsa](http://www.loveandoliveoil.com/2008/04/fish-tacos-with-mango-salsa.html) on Love and Oil.\n\nIn a bowl, combine:\n* 2 ripe fresh mangoes, chopped\n* 1/2 cup diced sweet onion\n* 1-2 tablespoons chopped fresh cilantro\n* Juice of 1 fresh lime\n* (optional): 1/2 fresh jalapeno, diced\n\nStir and serve.",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Simple Salsa Verde",
    "slug": "simple_salsa_verde",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/simple_salsa_verde.md",
    "recipe": "I got this base recipe from a vegan friend. If you can't find one of these peppers, swap in another one!\n\n* 6 Average-sized tomatillos\n* 1 Poblano pepper\n* 1 Serrano pepper\n* 1 Jalapeno pepper\n* 1 Sweet red pepper\n* Juice of 1 or 2 fresh-squeezed limes (to taste)\n* Pinch or two kosher salt (to taste)\n\nYou're in charge of the heat here. For a milder salsa, remove all the ribs and seeds inside the peppers. For medium, leave in a few ribs, and for hot, go nuts. Rough chop the peppers and tomatillos, then throw into a blender or food processor with salt and lime juice. Pulse to desired consistency.\n\nAs with most salsas, this will taste better if you let it sit in the fridge for a few hours before eating. It's great on chips or drizzled over steak or pork tacos.",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Roasted Tomatillo and Mushroom Sauce",
    "slug": "roasted_tomatillo_and_mushroom_sauce",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/roasted_tomatillo.md",
    "recipe": "* 2 pounds tomatillos\n* 4 dried chipotle chiles\n* 2 pounds shiitake mushrooms\n* 1/4 cup olive oil\n* 1 cup water\n\n1. Remove husks from tomatillos and rinse them. Place them whole on your oven's broiler rack. Broil and turn them until they're browned on all sides.\n2. Boil the water. Drop in the dried chiles and bring the water down to a simmer. Keep them in until they are soft.\n3. Slice the shiitakes and cook them in a pan with the olive oil until they're tender.\n4. Take the chiles and tomatillos (once they're cooled off) and blend them in a food processor until they make a nice puree.\n5. Put the blended tomatillo-chile mixture in a saucepan and bring it to a boil. Add the cooked mushrooms and bring it back to a boil. Then bring the heat down until the mixture is simmering. Cook for about 10 minutes. Add salt to taste.\n\n---\nA friend gave me this recipe a while back, but I can't remember who it was. Sorry, friend.",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Salsa de Aguacate",
    "slug": "salsa_de_aguacate",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/salsa_de_aguacate.md",
    "recipe": "This is the traditional green sauce served from a Mexican taco cart. Very popular with Tacos al Pastór or Tacos de Canasta, it is a creamy, green sauce. It has avacado, but it by no means a guacamole. Usually available with other taco cart staples such as: sliced radishes, spicy salsa roja, fresh cilantro, and fresh limes.\n\n* 1/2 Kilo of Green Tomatillos (~1lb.)\n* 2 green Serrano peppers (optional for heat)\n* 1 avocado\n* 2 limes\n* 1/2 cup crema (Mexican sour cream, thinner and sweeter than standard sour cream)\n\nCook the tomatillos and peppers in a pot with water until soft. Drain the water out and let cool.\n\nPut tomatillos, peppers, salt, lime-juice, crema, and avacado (shelled and pitted) in blender. With lid on, blend until completely mixed and liquid consistency. Salsa should be the consistency of crema, liquid, yet slightly viscous.\n\nPour over your tacos liberally. Refrigerate between uses.",
    "tags": ["vegetarian"]
  },
  {
    "name": "Homemade Kimchi",
    "slug": "homemade_kimchi",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/kimchi.md",
    "recipe": "Kimchi will take your taco in a decidedly unrestrained asian direction, but comfort zones were made to be broken. It takes some time to make, as fermentation needs to take place. It also may take some time to acquire a taste for it, but it's worth the effort.\n\n__Ingredients__\n\n* 1 napa cabbage\n* 1/2 cup kosher salt\n* 12 cups cold water (more if needed)\n* 8oz daikon radish, cut into matchstick-size strips.\n* 4 scallions, cut into 1-inch pieces\n* 1/3 cup Korean red pepper powder\n* 1/4 cup fish sauce\n* 1/4 cup minced fresh ginger\n* 1 tablespoon minced garlic\n* 2 teaspoons minced Korean salted shrimp\n* 1 1/2 teaspoons sugar\n\n__Directions__\n\n1. Split the cabbage in half lengthwise, then crosswise into 2-inch pieces; discard the root. Put the cabbage into a large bowl with the salt and toss until the salt is evenly distributed. Add cold water to cover, making sure the cabbage is submerged. Cover with saran wrap and let it sit at room tempurature anywhere form 12-24 hours.\n2. Drain the cabbage and rinse in cold water. Gently squeeze to get as much liquid out as you cam, and set the cabbage aside in a smaller bowl.\n3. Add the remaining ingredients to the large bowl and mix it all up. Add the cabbage and toss until the cabbage is thoroughly covered. \n4. Pack it all into a 2 quart glass jar and close it up. Make sure you get a tight seal.\n5. Stick the jar in a dark place for about 24 hours. Open the lid to let out the gasses that have been wanting to get out, then close it up again and put it in the fridge.\n6. Wait two more days, and voila, you have kimchi. Some people sya that it's best to wait at least a week before eating; it will last about a month.\n\nLots of other vegetables can be added; play around with it.\n\n__Puréed Kimchi__\n\nThanks to Momofuku, we know that puréeing kimchi takes a lot of the sweater smell out of it, and creates a smoother and rounder flavor, and is fantastic for squeezing onto tacos.",
    "tags": []
  },
  {
    "name": "Sour Cream",
    "slug": "sour_cream",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/sour_cream.md",
    "recipe": "Cool and tart, sour cream is an almost-essential part of the traditional American taco, and many others as well.",
    "tags": ["vegetarian"]
  },
  {
    "name": "Salsa Sauce",
    "slug": "salsa_sauce",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/salsa_sauce.md",
    "recipe": "From What's Cookin' Cookbook: A Recipe Collection from the Schlaback Family\n\n* 14 c. tomatoes, chopped\n* 2 1/2 c. onions\n* 4 tsp. fresh garlic\n* 2 (4 oz.) canned green chilies\n* 1 tsp. garlic powder\n* 1 tsp. salt\n* 2 tsp. paprika\n* 1/2 tsp. ground cumin\n* 1/4 tsp. oregano\n* 1 tsp. chili powder\n* 1/2 c. vinegar\n* 1 Tbsp. brown sugar\n\nMix and bring to a boil. Cook down 1 1/2 hours. Cold pack for 20 minutes.",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Chipotlé Sauce",
    "slug": "chipotlé_sauce",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/chipotle_sauce.md",
    "recipe": "__Ingredients__\n\n* 1 cup plain Greek yogurt\n* Juice from 2 limes\n* 2-3 chipotlé peppers, with surrounding adobo sauce from can\n\n__Directions__\n\n1. Drop all of this into a food processor, and blend away.\n2. Let sit in fridge for 30 minutes or overnight for flavor melding. \n3. Add to tacos, and anything else you'd like.",
    "tags": ["vegetarian"]
  },
  {
    "name": "Cashew Cheeze",
    "slug": "cashew_cheeze",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/cashew_cheeze.md",
    "recipe": "This is a good dairy sub but also just pretty damn delicious.\n\n* 1 cup raw organic cashews\n* 4 cups hot water\n* 1 small lemon, juiced and zested\n* 1/2 teaspoon salt (you can also play with other spices: garlic, cayenne, cumin etc. Go crazy!)\n* 2 tablespoons nutritional yeast\n* 1 roasted jalepeno (for spicy cheeze)\n\nIn a large bowl add the raw cashews and hot water. Cover with a kitchen towel and allow to soak for 2-4 hours. Drain the cashews and rinse well.\nAdd the soaked cashews, salt, nutritional yeast, jalepeno and the lemon juice in a blender or food processor. Blend on high and stir frequently scraping down the sides of the bowl. Keep processing the mixture until it is very smooth, and there are no lumps.\nFold in the lemon zest (optional) and add to a serving bowl. You can also add a bit more water to get more of a creamy texture and store in a squeeze bottle (That's my preference anyway).",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Garlic Lime Sauce",
    "slug": "garlic_lime_sauce",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/garlic_lime_sauce.md",
    "recipe": "This sauce packs a creamy, sour, garlicky punch and can cut the heat on a spicy salsa. It pairs well with Mango Lime Salsa for excellent fish tacos. This is a simplified version of the [lime sauce recipe](http://www.loveandoliveoil.com/2008/04/fish-tacos-with-mango-salsa.html) on Love and Oil.\n\nCombine in a bowl:\n* 1-2 tablespoons mayonnaise\n* 1/2 cup plain yogurt\n* 2 tablespoons fresh lime juice\n* 1-2 cloves minced garlic\n* salt to taste\n* (optional): chopped fresh cilantro garnish\n\nWhisk ingredients together in bowl.\n\nServe on the side, or drizzle as a decorative layer onto prepared tacos. Optionally sprinkle with chopped cilantro as garnish.",
    "tags": ["vegetarian"]
  },
  {
    "name": "Spicy Mayo",
    "slug": "spicy_mayo",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/spicy_mayo.md",
    "recipe": "__Ingredients__\n\n* 1/3 cup mayonnaise\n* 2 teaspoons gochujang paste\n\n__Directions__\n\nMix mayonnaise and gochujang together well. Let sit for 20 minutes so flavors can combine.\n\n_Note:_ Gochujang paste can be found at asian markets.",
    "tags": ["vegetarian"]
  },
  {
    "name": "Grilled Pineapple Pear Salsa",
    "slug": "grilled_pineapple_pear_salsa",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/grilled_pineapple_pear_salsa.md",
    "recipe": "__Ingredients__\n* 1/2 ripe pineapple, trimmed and sliced\n* 1 large medium-firm pear sliced into 1/4 inch slices\n* 1 large red bell pepper, seeded and quartered\n* 1/2 small red onion, peeled and cut in half (so you have 2 quarters of a whole onion)\n* 1 jalapeno, diced\n* 1/2 cup loosely packed cilantro, finely chopped\n* 1 tablespoon lime juice\n* 1/8 teaspoon ground ginger\n* 1/8 teaspoon ground cumin\n* salt and pepper to taste\n\n__Instructions__\n* Sautee red onions, pineapple, red bell peppers, pears, and jalapeno in olive oil on high heat. Do not move vegetables and pineapples around until they're slightly charred and caramelized.\n* Once the above ingredients are caramelized and charred, take them off the heat and place them in medium bowl.\n* Mix in cilantro, lime juice, ground ginger, ground cumin, and salt and pepper.\n\nCan be eaten immediately but it is best served chilled.",
    "tags": []
  },
  {
    "name": "Creamy Mustard Sauce",
    "slug": "creamy_mustard_sauce",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/creamy_mustard_sauce.md",
    "recipe": "Originally a sauce used on sandwiches until one day I ran out of sour cream for my tacos. This recipe is meant to be \"eye-balled.\"\n\n\n__Ingredients__\n\n* 1/2 part Ranch dressing\n* 1/4 part Yellow Mustard\n* 1/4 part Grey Poupon Harvest Course Ground Mustard\n\n__Directions__\n\n1. Mix all ingredients in container.\n2. Add to tacos, and anything else you'd like.\n3. Store in closed container in fridge.",
    "tags": ["vegetarian"]
  },
  {
    "name": "Teriyaki",
    "slug": "teriyaki",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/teriyaki.md",
    "recipe": "__Ingredients__\n\n- 2/3 cup mirin (Japanese sweet rice wine)\n- 1 cup soy sauce\n- 4 1/2 teaspoons rice vinegar\n- 1 teaspoon sesame oil\n- 7 cloves garlic, minced\n\n__Directions__\n\n- [ ] mix all ingredients\n- [ ] heat in a saucepan to a simmer, boil off alcohol",
    "tags": []
  },
  {
    "name": "Pickled Red Onions",
    "slug": "pickled_red_onions",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/pickled_red_onions.md",
    "recipe": "My wife made this recipe up, after eating something similar, but if you are making brisket tacos, it is the most wonderful accessory:\n\n__Ingredients__\n\n* Vinegar\n* 2 chopped red onions\n* 1 tablespoon of sugar\n* a dash of chili powder\n\nChop the red onions into rings and put them into a container of vinegar. Add the sugar and store the mixture in your refrigerator to marinate and pickle, the longer the better.\n\nPick out the rings and place them on your brisket taco. Eat.\n\nVariations\n----------\n\nPickled onions are a favorite in the Von Doom house, too. [@littlewhirl](http://twitter.com/littlewhirl) played around with a similar starting point and we use this brine instead:\n\n* 1/2 cup apple cider vinegar\n* 1 T Sugar (I usually use coconut palm sugar because I'm a hippie I guess)\n* Water\n* 1 1/2 tsp salt\n* 1 sprig fresh oregano and/or cilantro (optional)\n\nSlice 1 red onion on a mandolin (WORTH IT). In a bowl melt the sugar and salt with some warm/hot water. Add vinegar and 1c of filtered water.\nAdd in onion, top off w/ water so that the onion is just covered.\nVERY IMPORTANT: Let sit at room temp for at least an hour. Trust me.\n\nThe apple cider vinegar is a tangier but also more subtle, keeping more of the onion flavor there. And using a partial salt water brine lets it work nice for quick pickles, but also for slightly longer engagements. Leading to the most important aspect:\n\nPICKLE ALL THE THINGS\n---------------------\n\nSeriously. All the things. Pickle your fridge. Pickle your waffles. Make. Lots. Of. Pickles.\n\n* __Cabbage__ — red or green work. You only need an hour or so (like onions)\n* __Jalepeños__ — seriously GTFO these are good. Add dill for a twist. Add parboiled carrots if you want to cut the spice\n* __Greenbeans__ — because greenbeans are goddam delicious\n* __Toy cars — kid with an attitude? Pickle their favorite toy car. Let's see them try to cop a tude when their matchbox cars are soggy and briney\n* __Cauliflower__ — personal favorite. Pickles in an hour, super delicious\n* __Baby corn__ — baby corn is gross, but if you pickle it you can make jokes about how big all the other things you pickled are",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Guacamole Boris Karloff",
    "slug": "guacamole_boris_karloff",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/guacamole_boris_karloff.md",
    "recipe": "From the ubiquitous newspaper clipping, it's Karloff's recipe with sherry.\n\n* 2 avocados\n* 1 med. tomato, chopped fine\n* 1 small onion, minced\n* 1 tbsp. chopped canned green chiles\n* 1 tbsp. lemon juice\n* 1 tsp sherry\n* Dash cayenne, optional\n* Salt, pepper\n\nPeel and mash avocados.\nAdd onion, tomato and chiles, then stir in lemon juice, sherry and seasonings to taste, blending well.\nServe as a dip for tortilla pieces or corn chips or as a canape spread.\n\nMakes 10 to 12 appetizer servings.",
    "tags": []
  },
  {
    "name": "Yogurt",
    "slug": "yogurt",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/yogurt.md",
    "recipe": "Plain Balkan or Greek type yogurts add flavour and moisture. May be used as an\nalternative to sour cream. While sweet and fruit flavoured yogurts are not\nrecommended, speciality yogurt dips such as jalapeno provide delicious\nvariation.",
    "tags": ["vegetarian"]
  },
  {
    "name": "Pickled Jalapeños",
    "slug": "pickled_jalapeños",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/pickled_jalapeños.md",
    "recipe": "__Ingredients:__\n\n* 3/4 cup white vinegar\n* 3/4 cup water\n* 2 tablespoon sugar (optional)\n* 1 tablepoon kosher salt\n* 1/2 teaspoon oregano\n* 1 clove of garlic\n* Dash of crushed red pepper (optional)\n* 8-10 sliced jalapeños\n\n__Directions:__\n\n* Bring vinegar, water, sugar, salt, oregano, garlic, and red pepper to a boil in a saucepan\n* Stir in sliced jalapeños, then remove from heat\n* Cover saucepan and allow it to sit for 15-20 minutes\n* Use tongs to put the jalapeños into a jar, then pour in the rest of the mixture until the jar is full\n* Refridgerate for atleast 30 minutes (preferably overnight)",
    "tags": []
  },
  {
    "name": "Roasted Tomato Salsa",
    "slug": "roaster_tomato_salsa",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/roasted_tomato_salsa.md",
    "recipe": "## Ingredients:\n\n2 pounds roma tomatoes, cut in half lengthwise\n6 unpeeled garlic cloves\n1 large onion peeled, cut into slices\n1 jalapeno pepper, halved (remove inside if you would like it less spicy)\n1 handful fresh cilantro\n1 freshly-squeezed lime\n2 teaspoons salt\n1/2 teaspoon ground cumin\n\nINSTRUCTIONS:\n\n1.  Turn broiler on high.\n2.  Place tomatoes (skin side up), garlic, onion and jalapeno on cookie sheet and put in broiler for about 5 min. until skins start to blacken. \n3.  Remove from broiler and let cool (refrigerate to cool quicker or if you like warm salsa continue on to step 4.)\n4.  Place ALL ingredients into blender and blend until you have the consistancy you like.\n5.  Serve and enjoy",
    "tags": []
  },
  {
    "name": "Pickled Chilis and Vegetables",
    "slug": "pickled_chilis_and_vegetables",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/pickled_chilis_and_vegetables.md",
    "recipe": "* 1 cup water\n* 1 cup white vinegar or unseasoned rice vinegar\n* 1 tablespoon sugar\n* 2 tablespoons kosher salt\n* 4 bay leaves\n* 5 lightly crushed peeled garlic cloves\n* 1 bunch of cilantro stems, finely chopped (optional)\n* 1/2 teaspoon dried oregano\n* 1 peeled medium carrot, sliced into 1/4 inch slices\n* 3 fresh hot chilis (jalepenos, aji amarillo, or peppers of your choice), sliced into 1/4 inch slices\n* 10 radishes sliced into quarters\n* 1/2 a red onion, sliced into 1/4 inch slices\n\n1. Bring water, vinegar, sugar, salt, bay leaves, garlic, optional cilantro stems, and oregano to a simmer in a small saucepan until salt and sugar are dissolved.\n2. Add vegetables and simmer 1 minute.\n3. Cover pan and let sit on stovetop for 15 minutes.\n4. Transfer to container, cover with brine, and store in the fridge. Keeps a monthish? They never last that long.\n\n_Notes_\n\nLots of other vegetables could work here: green beans, chopped celery, daikon radish, whatever!",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Onions and Cilantro",
    "slug": "onions_and_cilantro",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/onions_and_cilantro.md",
    "recipe": "* 1 white onion, peeled.\n* Bunch of cilantro, long bottom stems removed (stems between leaves are fine).\n* Juice of one lime.\n\n1. Dice white onion into 0.50 inch dice.\n2. Roughly chop cilantro.\n3. Add onion and cilantro to a bowl with the lime juice and mix thoroughly.\n4. Store in an airtight container for up to a week.",
    "tags": []
  },
  {
    "name": "Pico de Gallo",
    "slug": "pico_de_gallo",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/Pico_de_gallo.md",
    "recipe": "_Super Quick & Easy Pico_\n\n\n* 1 pint grape tomatoes, quartered (make your kids do this part)\n* 3 tablespoons finely chopped white onion\n* Coarse salt\n* Squeeze of lime\n* As many finely chopped red (or green) jalapeños as you want (optional)\n\nCombine the tomatoes, cilantro and onion together in a bowl. Season to taste with salt and lime.\n\nReserve some of this mixture for kids, and then add as much jalapeño as you like to the remaining mixture for the non wimps.",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Black Olives",
    "slug": "black_olives",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/black_olives.md",
    "recipe": "Canned black olives add a sweet and cool meatiness to a traditional American taco.",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Gochujang Cucumbers",
    "slug": "gochujang_cucumbers",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/gochjang_cucumbers.md",
    "recipe": "__Ingredients__\n* 2 tablespoon Gochujang sauce\n* 2 small cucumbers or 1 large cucumber\n* 1/4 tsp salt\n* 2 teaspoon sugar\n* 1 tablespoon rice wine vinegar\n\n__Instructions__\n* Chop the cucumbers into 1/4 inch rounds\n* Sprinkle the slices with salt\n* Wait 10 minutes and pat dry with paper towel\n* Mix gochujang sauce, vinegar, and sugar\n* Toss the cucumbers into the mixture",
    "tags": []
  },
  {
    "name": "Cranberry Salsa",
    "slug": "cranberry_salsa",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/cranberry_salsa.md",
    "recipe": "Ingredients\n------------\n* 1 bag cranberries\n* 1 cup water\n* 3/4 cup sugar\n* half a small white onion (chopped)\n* 1 jalepeño, chopped small (remove seeds & wash for less heat)\n* 1 bunch cilantro (cut up)\n* 1 lime\n\nDirections\n-----------\n1. In a saucepan, get your water and sugar boiling, then add the cranberries. Boil until the cranberries pop (5-10 minutes), then take off heat, drain, and cool. They'll be slightly jelly-like, but you don't want them to disintegrate entirely, so watch them closely.\n\n2. While the cranberries are cooling, chop your white onion, your jalepeño and cilantro.\n\n3. Once your berries are cool, they'll probably have turned gooey. If there is still a bunch of water, drain it. But it's probably turned to jelly.\n\n4. Combine everything, and give a good squeeze of lime over the whole thing. As you combine, you'll notice that the cranberries just give up their shape entirely. Also: Don't wear your finest clothing when you do this--this shit _stains_.\n\n5. Make adjustments based on taste here. Your main variables are:\n\t* Sweet vs tangy. Default right now is tangy. Add more sugar for sweet.\n\t* Battling the overwhelmingness of the cranberries. You've got two things going with the cranberries here: flavor and texture. More onion will add more crunch to the whole thing, and help boost up the salsa-ness. Jalepeño is your heat adjustment--seeds are your friend. But the Cilantro is your big mover here: it helps to round out the sharpness of the cranberry. Lime also helps bring down the cranberry overload.\n\n\nOrange  Holographic Varient Cover\n------------------------------------------------\n\n* Go with half a cup of OJ and half a cup of water to boil your berries in.\n* Compliment the lime juice with a fresh squeezed orange and then *zest* that motherfucker right into the salsa",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Mango Avocado Pico de Gallo",
    "slug": "mango_avocado_pico_de_gallo",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/mango_avocado_pico.md",
    "recipe": "\n\nIngredients:\n\n1 c. small cubes of mango (about 1 medium to large RIPE mango - not too mushy, though)  \n1 small avocado, cubed\n1/2-1 large jalapeno pepper (1/2 without seeds will give you a nice, mild-medium heat - add from there)  \n1/4 c. chopped cilantro  \n1/4 of a medium red onion, finely chopped  \nJuice of 1 lime  \n2-3 cloves garlic, minced  \nKosher or sea salt to taste  \nDash of chipotle pepper flakes or chipotle tabasco sauce if smoke is your thing\n\nInstructions:\n\nCombine ingredients. Best served immediately, but will keep for a day. Excellent topping for fish or chicken tacos, or served just with chips.",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Asian Cabbage Slaw",
    "slug": "asian_cabbage_slaw",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/asian_cabbage.md",
    "recipe": "Add this to [Asian Style Tacos](/full_tacos/asian_style_tacos.md) for a taste sensation.\n\nIngredients\n-----------\n\nFor the dressing:\n\n* 1 lime, juiced\n* 2 Tbs Rice vinegar\n* 2 tsp sugar\n* 1 Tbs toasted sesame oil\n* 1 Tbs olive oil\n* a squirt or two of sriracha\n* pinch of salt\n\nFor the slaw:\n\n* 1/2 head cabbage, chopped thin (slaw style)\n* 2 spring onions (scallions), chopped.\n* some cilantro, chopped up, to taste\n\nDirections\n----------\n\n1. Combine all the dressing ingredients in a big bowl, whirl them together until the sugar dissolves. Adjust the amount of sriracha in there to the heat you want your dressing to be.\n\n2. Toss the chopped cabbage, onions, and cilantro in with the dressing.\n\n3. Mix until everything is lightly dressed.\n\nYAY EVERYTHING.",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Pineapple Lime Crema",
    "slug": "pineapple_lime_crema",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/pineapple_lime_crema.md",
    "recipe": "__Ingredients__\n* 1 5.3 ounce pineapple yogurt\n* 2 tablespoons mayonnaise\n* 1/2 tablespoon lime juice\n\n__Instructions__\n* Whisk ingredients together in small bowl.\n* Place in refrigerator until ready to use.",
    "tags": []
  },
  {
    "name": "Chipotle Pineapple Sauce",
    "slug": "chipotle_pineapple_sauce",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/chipotle_pineapple_sauce.md",
    "recipe": "Ingredients\n\n    250 g chopped fresh pineapple\n    1 minced onion\n    15 ml olive oil\n    2-3 chipotle peppers, with surrounding adobo sauce from can\n    120 ml water\n\nDirections\n\n    Sautee the onion in the oil until translucent\n    Add pineapple and let cook for just a couple minutes\n    Add water and peppers and sauce and cook until reduced to just thinner than a paste",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Caramelized red onions",
    "slug": "caramelized_red_onions",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/caramelized_red_onions.md",
    "recipe": "* 3 medium red onions, trimmed and sliced into 1/4 inch slices\n* 1 tablespoon salted butter\n* 1 tablespoon olive oil\n* Juice of 2-3 limes (about 1/4 cup)\n* Koser salt, to taste\n\n1. Melt butter with oil over low heat.\n2. Add onions, and stir to combine.\n3. Cook, stirring occasionally, for about 50 minutes, until darkly caramelized. If they are sticking too much or starting to burn, add a splash of water to the pan and stir.\n4. Deglaze with lime juice, add salt to taste.",
    "tags": ["vegetarian"]
  },
  {
    "name": "Baja White Sauce",
    "slug": "baja_white_sauce",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/baja_white_sauce.md",
    "recipe": "This is a traditional white sauce for [Baja fish tacos](../full_tacos/baja_fish_tacos.md).\n\n* 1/4 cup mayo\n* 2 tbsp sour cream\n* 1 tbsp lime juice\n* 1/4 tsp celery salt (or garlic salt, etc)\n\nMix, and refrigerate for an hour if possible.",
    "tags": []
  },
  {
    "name": "European Sour Cream",
    "slug": "european_sour_cream",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/european_sour_cream.md",
    "recipe": "It is hard to find sour cream in Europe. This is a suitable alternative using more readily available ingredients.\n\n* 1 cup crème fraîche\n* juice of 1 lime\n* pinch of salt\n\nCombine ingredients. Serve immediately or refrigerate.",
    "tags": ["vegetarian"]
  },
  {
    "name": "Salsa de Chile de árbol",
    "slug": "salsa_de_chile_de_arbol",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/chile_de_arbol_sauce.md",
    "recipe": "This is a go-to taco sauce in western Mexico and probably elsewhere. You can\nmix and match the techniques in the two variants presented here, and substituting\nor adding chiles is a ramp onto the combinatorial superhighway of Mexican food and\ncan demystify the salsa bar at the local taquería.\n\n# Red\n\n* dried whole *chiles de árbol*\n* tomatoes\n* onion\n* *optionally*, garlic\n\nTake between .3 and 1 chiles per tomato, remove the stems and put them in a\nsaucepan with a tablespoon or two of oil (olive, soy, etc.) The pan and oil should be very\nhot and the chiles should seem to be at risk of burning. Rotate the\nchiles around and let them get dark brown to black without actually burning them —\nthis can happen quickly, which is good because your eyes, nose, and lungs\nmay reach their maximum vaporized chile tolerance during this step.\n\nAdd a bunch of chopped onion and garlic and lower the heat. Cut the tomatoes\nin half and throw them in with salt to taste. Cook until the tomatoes look stewed.\nIf you have one of those blender wands that you can put directly in a saucepan,\nyou can blend everything now (you may end up making this sauce frequently enough\nto justify the purchase of a blender wand.) Otherwise wait until the mixture\nis not hot and blend it in a standard blender.\n\n# Green\n\n* dried whole *chiles de árbol*\n* green tomatillos\n* onion\n* cilantro\n\nTake between .1 and .5 chiles per tomatillo, remove the stems and put them in a bare, hot saucepan.\nToast the chiles without oil until they are dark. Add halved or quartered tomatillos, salt, and a\ntablespoon or two of water to prevent burning the chiles before the tomatillos release\ntheir juices. When the mixture has cooked for as long as you can stand to wait, remove\nthe heat and let it cool. Blend and place in a little salsa bowl and heap with finely\nchopped onion and cilantro.\n\nOne non-obvious little point is that skipping the oil in the chile roasting-toasting\nstep seems to increase the spiciness of the final product.",
    "tags": ["vegetarian"]
  },
  {
    "name": "Guacamole (Simple)",
    "slug": "guacamole_simple",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/guacamole_simple.md",
    "recipe": "If you're not in the mood to be fussy, this could be considered a minimum-viable guacamole recipe.\n\n* 2 ripe avocados\n* 2-4 limes, depending on juiciness, delivering 2-4T of lime juice\n* 1 diced tomato (seeded if it's a big one)\n* salt (to taste)\n* hot sauce (to taste; Frank's Red Hot is a standard, but go with what you like)\n\n1. Scoop the avocado meat into a bowl and mash them with a fork. Leave it a bit lumpy as we will do more stirring in a bit and we don't want to over-work them.\n2. Add the chopped tomato.\n3. Add the lime juice; hold some back for later adjustment).\n4. Add ½t salt.\n5. Add 2T hot sauce.\n6. Stir with the fork again.\n7. Taste.\n8. Adjust salt/lime/hot sauce as desired.\n\nThis recipe will support one average-size bag of chips, so adjust quantities based on expectations.",
    "tags": ["vegetarian"]
  },
  {
    "name": "Cabbage Slaw",
    "slug": "cabbage_slaw",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/cabbage_slaw.md",
    "recipe": "__Ingredients__\n\n* 4 cups shredded green cabbage\n* 3 tablespoons apple cider vinegar\n* 3 tablespoons extra virgin olive oil\n* 2 tablespoons brown sugar\n* Sea salt and freshly ground black pepper\n\n__Directions__\n\nAdd first four ingredients to a bowl and stir to combine. Season with salt and pepper to taste, and stir again. Let sit for 20 minutes so flavors can meld.",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Lime",
    "slug": "lime",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/lime.md",
    "recipe": "Cut a lime into quarters or eights and squeeze juice onto any taco.\n\n*You may omit this ingredient when limes are out of season.*",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Mango Avocado Salsa",
    "slug": "mango_avocado_salsa",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/mango_avocado_salsa.md",
    "recipe": "Goes great on soft shell chicken tacos with cheese (or deep-friend wantons with scallops)!\n\n__Ingredients__\n\n* 2 Avocados\n* 2 Mangos\n* 1 Orange\n* 1 Tablespoon Honey\n* Garlic cloves (leave it up to your buds)\n* Pepper\n* 1 Lime\n\n__Directions__\n\n1. Chop avocado and mango into bowl.\n2. Squeeze the lime and half the orange in, add honey.\n3. Add garlic (chopped or pressed) and pepper to taste.\n4. Stir and enjoy!",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Beet Salsa",
    "slug": "beet_salsa",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/beet_salsa.md",
    "recipe": "Tired of plain ol' [Carne Asada Tacos](../base_layers/chooped_steak.md)? Get exotic with beet salsa.\n\n* 4 - 6 Roma tomatoes\n* 1 - 2 Serrano pepper\n* Reasonably sized onion (green or vidalia)\n* 10 garlic cloves (leave it up to your buds, I like 10 or more)\n* Salt and pepper to taste\n* 1 bunch of beets\n* 1 or more lemons\n\nFry tomatoes, pepper(s), onion and garlic in a pan until they are brown and tomato skins are peeling away. Move ingredients to the blender and purèe. Chop beets to a blendable size and add to salsa. Add salt and pepper to taste. Squeeze in desired amount of lemon and blend one more time.",
    "tags": ["vegetarian", "vegan"]
  },
  {
    "name": "Vindaloo Sauce",
    "slug": "vindaloo_sauce",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/vindaloo_sauce.md",
    "recipe": "Vindaloo sauce can be prepared or store bought.\nVindaloo is an Indian curry sauce that is popular in the Goa region of India. \n",
    "tags": []
  },
  {
    "name": "Caramelized Pineapple",
    "slug": "caramelized_pineapple",
    "url": "https://github.com/dansinker/tacofancy/blob/master/base_layers/caramelized_pineapple.md",
    "recipe": "If you're making [crock pot al pastor](/base_layers/crock_pot_fake_al_pastor.md), make this too.\n## Ingredients\n\n* 1/3 of a pineapple, peeled and chopped in 1/2 inch dice\n* 2 tablespoons reserved fat from [crock pot al pastor](/base_layers/crock_pot_fake_al_pastor.md) **OR** 2 tablespoons neutral flavored oil such as canola, and 1/4 teaspoon chipotle powder.\n\n## Directions\n1. If not using the pork fat, toss the pineapple with the chipotle powder.\n2. Heat the oil or fat in a pan over medium high heat. When it is hot, add the pineapple.\n3. Don't stir too much, let it get good and brown, this takes a few minutes. Watch to make sure the pineappled doesn't burn. Stir once or twice to brown a few different sides of the fruit.\n4. Serve warm.",
    "tags": []
  }
]
